package api

const (
	messageNotImplemented          = "Привет! Я - бот помощник для ДнД. Я пока этого не умею, но я рад тебя видеть!😀"
	messageRejectedRightsViolation = "Эй, тормози, тебе кто разрешил такое делать?🚨"
	messageGetUserBalanceSuccess   = "Баланс %s - %d💰"
	messageSetUserBalanceSuccess   = "Баланс %s теперь %d💰"
	messageThrowDice               = "Ииии, на кубике выпало %d"
	messageNotRegistered           = "Игрок %s еще не зарегался, так что залупу тебе за воротник а не его дегьги :)"
)
